<?php

$major = array(0 => "無科系", 1 => "中國文學系", 2 => "歷史學系", 3 => "哲學系", 4 => "音樂學系", 5 => "應用美術學系", 6 => "景觀設計學系", 7 => "影像傳播學系", 8 => "新聞傳播學系", 9 => "廣告傳播學系", 10 => "體育學系",
11 => "圖書資訊學系", 12 => "醫學系", 13 => "護理學系", 14 => "公共衛生學系", 15 => "臨床心理學系", 16 => "職能治療學系", 17 => "呼吸治療學系", 18 => "數學系", 19 => "物理學系", 20 => "化學系",
21 => "生命科學系", 22 => "資訊工程學系", 23 => "電機工程學系", 24 => "英國語文學系", 25 => "德國語文學系", 26 => "法國語文學系", 27 => "西班牙語文學系", 28 => "日本語文學系", 29 => "義大利語文學系", 30 => "兒童與家庭學系",
31 => "餐旅管理學系", 32 => "食品科學系", 33 => "營養科學系", 34 => "法律學系", 35 => "財經法律學系", 36 => "學士後法律學系", 37 => "社會學系", 38 => "社會工作學系", 39 => "經濟學系", 40 => "宗教學系",
41 => "心裡學系", 42 => "企業管理學系", 43 => "會計學系", 44 => "統計資訊學系", 45 => "金融與國際企業學系", 46 => "資訊管理學系", 47 => "織品服裝學系");

$emotional = array(0 => "不顯示", 1 => "秘密", 2 => "單身", 3 => "穩定交往", 4 => "交往中但保有交友空間", 5 => "一言難盡", 5 => "一言難盡");

function index_to_major($index) {
    global $major;
    return $major[$index];
}

function major_to_index($major_name) {
    global $major;
    return array_search($major_name, $major);
}

function index_to_emotional($index) {
    global $emotional;
    return $emotional[$index];
}

function emotional_to_index($emotional_text) {
    global $emotional;
    return array_search($emotional_text, $emotional);
}
?>
